app/controllers/app_controller.rb

  def locations_create
    params[:location][:user_id] = current_user.id
    @aq.create_location(params[:location])
---
INSERT INTO "locations" ("created_at", "decimal", "latitude", "longitude", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)